Merge pull request #1 from airgradienthq/go/feat/restructure-docs-workflow
Align docs with templates and add CI validation
